In [1]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df=pd.DataFrame({'key1':['a','a','b','b','a'],
                 'key2':['one','two','one','two','one'],
                 'data1':np.random.randn(5),
                  'data2':np.random.randn(5)
    
})

In [5]:
df

  key1 key2     data1     data2
0    a  one -0.613428 -0.517616
1    a  two -0.274819 -0.802195
2    b  one  0.129998 -0.901286
3    b  two -0.201283 -2.167922
4    a  one -0.183700  0.121010

In [6]:
df.groupby('key1')

In [7]:
df.groupby('key1')['data1']

In [9]:
df.groupby(['key1','key2'])['data2'].mean()

key1  key2
a     one    -0.198303
      two    -0.802195
b     one    -0.901286
      two    -2.167922
Name: data2, dtype: float64

In [12]:
people=pd.DataFrame(np.random.randn(5,5),
                    columns=['a','b','c','d','e'],
                    index=['Joe','Steve','Wes','Jim','Travis']
                   )

In [13]:
people

               a         b         c         d         e
Joe    -0.045109  0.424576 -0.518415 -0.612191  1.362866
Steve   1.205651 -0.621671  0.301795 -0.065677 -0.225238
Wes    -1.940249 -3.762146 -0.080693  0.628929  0.714071
Jim     0.303813 -0.302234 -0.051298 -0.404020  0.022811
Travis -0.356768  0.726577  0.941399  0.813144 -0.559517

In [14]:
people.iloc[2:3,[1,2]]=np.nan

In [15]:
people

               a         b         c         d         e
Joe    -0.045109  0.424576 -0.518415 -0.612191  1.362866
Steve   1.205651 -0.621671  0.301795 -0.065677 -0.225238
Wes    -1.940249       NaN       NaN  0.628929  0.714071
Jim     0.303813 -0.302234 -0.051298 -0.404020  0.022811
Travis -0.356768  0.726577  0.941399  0.813144 -0.559517

In [16]:
key_list=['one','one','one','two','two']

In [17]:
people.groupby([key_list]).min()

            a         b         c         d         e
one -1.940249 -0.621671 -0.518415 -0.612191 -0.225238
two -0.356768 -0.302234 -0.051298 -0.404020 -0.559517

In [18]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -1.940249  0.424576 -0.518415 -0.612191  0.714071
  two  0.303813 -0.302234 -0.051298 -0.404020  0.022811
5 one  1.205651 -0.621671  0.301795 -0.065677 -0.225238
6 two -0.356768  0.726577  0.941399  0.813144 -0.559517

In [21]:
columns=pd.MultiIndex.from_arrays(
[['US','US','US','JP','JP'],
 [1,3,5,1,3]],
 names=['cty','tenor']
)

In [22]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           codes=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [24]:
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)

In [25]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.742880  0.878785 -0.058789 -0.765321 -0.529020
1      0.427040 -0.565075 -0.049548 -2.642691  0.546168
2     -0.206576  1.192648  0.032806  0.172519  0.681085
3     -1.211841 -1.544158  0.046519  0.280537  0.652722

In [26]:
df

  key1 key2     data1     data2
0    a  one -0.613428 -0.517616
1    a  two -0.274819 -0.802195
2    b  one  0.129998 -0.901286
3    b  two -0.201283 -2.167922
4    a  one -0.183700  0.121010

In [27]:
grouped=df.groupby('key1')

In [29]:
grouped['data1'].quantile(0.9)

key1
a   -0.201924
b    0.096870
Name: data1, dtype: float64

In [30]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [31]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.429728  0.923204
b     0.331281  1.266636